## Pandas

1. The name "pandas" has a reference to both "panel data", and "python data analysis" and was created by wes mckinney in 2008.

2. Pandas is a python library used for working with data sets.

3. It has functions for analyzing, cleaning, exploring, and manipulating data.

## Pandas Data Structures

Series: One-Dimensional labeled arrays pd.Series(data)

DataFrames: Two-Dimensional data structure with columns  much like a table.

Panel: A panel is a 3D container of data.

## Importance of Pandas in Python

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data

Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects

Data set merging and joining. Flexible reshaping and pivoting of data sets proved time-series functionality

In [1]:
import pandas as pd

#### Data structure in pandas

1.The Pandas provides two data structures for processing the data.

Series & DataFrame and Panel

Series : It is defined as a one-dimensional array that is capable of storing various data types.

In [4]:
x = [3,4,5,6,78,2]
df  = pd.Series(x)
print(df)
print(type(df))

0     3
1     4
2     5
3     6
4    78
5     2
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
print(df[5])

2

In [8]:
x = [3,4,5,6,78,2]
df  = pd.Series(x,index=['a','b','c','d','e','f'],dtype="float",name ="Rishabh")
print(df)

a     3.0
b     4.0
c     5.0
d     6.0
e    78.0
f     2.0
Name: Rishabh, dtype: float64

In [9]:
dic = {'name':["python",'c','java','c++'],'rank':[1,4,3,2]}
df1 = pd.Series(dic)
print(df1)

name    [python, c, java, c++]
rank              [1, 4, 3, 2]
dtype: object

In [11]:
s = pd.Series(120)
print(s)
print(type(s))

0    120
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
s1=pd.Series(12, index =[2,2,3, 4,5, 6,7])
s2 = pd.Series(12, index=[1,2,3, 4,5, 6])
print(s1+s2)

1     NaN
2    24.0
2    24.0
3    24.0
4    24.0
5    24.0
6    24.0
7     NaN
dtype: float64

#### Data frame

In [13]:
l=[1,2,3,4,5,6,7,8,9]

var2 = pd.DataFrame(l)
print(var2)
print(type(var2))

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9
<class 'pandas.core.frame.DataFrame'>

In [15]:
d = {
    "Rishabh Prajapati": {
        "age": 20,
        "degree": "BS in Computer Science and Data Analytics",
        "university": "IIT Patna"
    },
    "Aditi Sharma": {
        "age": 21,
        "degree": "BSc in Mathematics",
        "university": "Delhi University"
    }
}

# Create a DataFrame
var3 = pd.DataFrame(d)

# Print the DataFrame and its type
print(var3)
print(type(var3))

                                    Rishabh Prajapati        Aditi Sharma
age                                                20                  21
degree      BS in Computer Science and Data Analytics  BSc in Mathematics
university                                  IIT Patna    Delhi University
<class 'pandas.core.frame.DataFrame'>

In [16]:
var3 = pd.DataFrame(d).transpose()
print(var3)

                  age                                     degree  \
Rishabh Prajapati  20  BS in Computer Science and Data Analytics
Aditi Sharma       21                         BSc in Mathematics

                         university
Rishabh Prajapati         IIT Patna
Aditi Sharma       Delhi University

In [22]:
fixed_num_data = pd.DataFrame({
    "Student ID": [101, 102, 103, 104, 105],
    "Marks": [85, 90, 78, 92, 88],
    "Age": [20, 21, 19, 22, 20]
     
})
print(fixed_num_data)

   Student ID  Marks  Age
0         101     85   20
1         102     90   21
2         103     78   19
3         104     92   22
4         105     88   20

In [21]:
fixed_num_data = pd.DataFrame({
    "Student ID": [101, 102, 103, 104, 105],
    "Marks": [85, 90, 78, 92, 88],
    "Age": [20, 21, 19, 22, 20]
     
},columns=["Student ID"])
print(fixed_num_data)

   Student ID
0         101
1         102
2         103
3         104
4         105

Arithmetic operations in Python Pandas

In [23]:
var4 = pd.DataFrame({'a':[2,3,4,5],'b':[1,3,4,5]})
var4

   a  b
0  2  1
1  3  3
2  4  4
3  5  5

In [25]:
var4['c'] = var4['b']+var4['b']
var4

   a  b   c
0  2  1   2
1  3  3   6
2  4  4   8
3  5  5  10

In [26]:
var4['c'] = var4['b']-var4['b']
var4

   a  b  c
0  2  1  0
1  3  3  0
2  4  4  0
3  5  5  0

In [27]:
var4['c'] = var4['b']*var4['b']
var4

   a  b   c
0  2  1   1
1  3  3   9
2  4  4  16
3  5  5  25

In [28]:
var5 = pd.DataFrame({'a':[20,30,40,50],'b':[11,43,46,35]})
var5

    a   b
0  20  11
1  30  43
2  40  46
3  50  35

In [30]:
var5['python'] = var5['a'] <=40
var5

    a   b  python
0  20  11    True
1  30  43    True
2  40  46    True
3  50  35   False

Delete and Insert Functions in Python Pandas

In [31]:
var6 = pd.DataFrame({'a':[20,30,40,50],'b':[11,43,46,35]})
var6

    a   b
0  20  11
1  30  43
2  40  46
3  50  35

In [37]:
var6['python'] = var6['a'] * var6['b']
print(var6)

    a  python   b
0  20     220  11
1  30    1290  43
2  40    1840  46
3  50    1750  35

In [42]:
var6 = pd.DataFrame({'a': [20, 30, 40, 50], 'b': [11, 43, 46, 35]})
var6.insert(2, "python_new", [50, 90, 40, 60])
print(var6)

    a   b  python_new
0  20  11          50
1  30  43          90
2  40  46          40
3  50  35          60

In [43]:
var6['python_new_12']= var6['a'][:2]
var6

    a   b  python_new  python_new_12
0  20  11          50           20.0
1  30  43          90           30.0
2  40  46          40            NaN
3  50  35          60            NaN

In [44]:
var6.pop("b")
var6

    a  python_new  python_new_12
0  20          50           20.0
1  30          90           30.0
2  40          40            NaN
3  50          60            NaN

In [45]:
del var6['python_new_12']
var6

    a  python_new
0  20          50
1  30          90
2  40          40
3  50          60

Write CSV File in Python Pandas

â€¢ CSV format is a plain text format in which values are separated by commas (Comma Separated Values).

In [46]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

df = pd.DataFrame(data)

In [47]:
df.to_csv("output.csv", index=False)
print("CSV file 'output.csv' created successfully!")

CSV file 'output.csv' created successfully!